import Footer from "../../components/footer/Footer";
import Navbar from "../../components/navbar/Navbar";
import styles from './aboutUs.module.css'
import image from './../../assets/images/img1.jpg'

export default function AboutUs(){


    return(
        
        <div className={styles.aboutPage}>
         <Navbar/>   
        <div className="cntr">
        <h2>درباره ما </h2>
            <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
            <h3>ما در کجا فعالیت داریم؟</h3>
            <div className={styles.imgCntr}>
                <img src={image}></img>
            </div>
            
        </div>
        <Footer/>
         </div>
    )
}